Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.23/samha0wb/svd/ATSAMHA0G14WB.svd
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>COMPCTRL[%s]</name>
               <description>Comparator Control n</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SINGLE</name>
                     <description>Single-Shot Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPEED</name>
                     <description>Speed Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SPEEDSelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low speed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High speed</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INTSEL</name>
                     <description>Interrupt Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>INTSELSelect</name>
                        <enumeratedValue>
                           <name>TOGGLE</name>
                           <description>Interrupt on comparator output toggle</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING</name>
                           <description>Interrupt on comparator output rising</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING</name>
                           <description>Interrupt on comparator output falling</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOC</name>
                           <description>Interrupt on end of comparison (single-shot mode only)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXNEG</name>
                     <description>Negative Input Mux Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MUXNEGSelect</name>
                        <enumeratedValue>
                           <name>PIN0</name>
                           <description>I/O pin 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN1</name>
                           <description>I/O pin 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN2</name>
                           <description>I/O pin 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN3</name>
                           <description>I/O pin 3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VSCALE</name>
                           <description>VDD scaler</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANDGAP</name>
                           <description>Internal bandgap voltage</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC</name>
                           <description>DAC output</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXPOS</name>
                     <description>Positive Input Mux Selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MUXPOSSelect</name>
                        <enumeratedValue>
                           <name>PIN0</name>
                           <description>I/O pin 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN1</name>
                           <description>I/O pin 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN2</name>
                           <description>I/O pin 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN3</name>
                           <description>I/O pin 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWAP</name>
                     <description>Swap Inputs and Invert</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OUT</name>
                     <description>Output</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OUTSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>The output of COMPn is not routed to the COMPn I/O port</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>The asynchronous output of COMPn is routed to the COMPn I/O port</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>Hysteresis Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLEN</name>
                     <description>Filter Length</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FLENSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>No filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAJ3</name>
                           <description>3-bit majority function (2 of 3)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAJ5</name>
                           <description>5-bit majority function (3 of 5)</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <name>SCALER[%s]</name>
               <description>Scaler n</description>
               <addressOffset>0x20</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Scaler Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
